#include <stdio.h>  //підключення стандартних бібліотек
#include <stdlib.h>
#include <math.h>

int main() {
    // =========================================================================
    // ОГОЛОШЕННЯ ЗМІННИХ ТА ПОЯСНЕННЯ ТИПІВ ДАНИХ!                            |
    // =========================================================================

    // mode — номер варіанта введення (1 або 2).
    // Тип int - ціле число.
    int mode = 0;

    // x1 — початок інтервалу, x2 — кінець інтервалу, delta — крок зміни аргументу.
    // Тип double — дійсне число з плаваючою крапкою.
    double x1 = 0.0;
    double x2 = 0.0;
    double delta = 0.0;

    // n — кількість точок у таблиці розрахунку.
    // Тип unsigned int — ціле беззнакове число
    // Кількість точок не може бути від'ємною, тому за вимогами використовуємо unsigned int.
    unsigned int n = 0;
  
return 0;
}
